/*******************************************************************
**我们的FPGA开发网
**网站：www.OurFPGA.com
**淘宝：OurFPGA.taobao.com
**邮箱: OurFPGA@gmail.com
**欢迎大家登陆网站，参与FPGA及电子技术讨论，下载免费视频教程及资料
*****************文件信息********************************************
**创建日期：   2011.06.01
**版本号：     version 1.0
**功能描述：   拨码开关驱动控制LED
********************************************************************/


module ckey_led(ckey,led);
  input  [4:1] ckey;                   // ckey[1]  ~ ckey[4]
  output [4:1] led;                    // led[1] ~ led[4]
   

// 开发板上led[1]在左，led[8]在右；送1灭，送0亮
// 拨动开关ckey打开为0，关闭为1
assign led = ckey;

endmodule